cook_book = [
    ["салат",
     [
         ["картофель", 100, "гр."],
         ['морковь', 50, "гр."],
         ['огурцы', 50, 'гр.'''],
         ['горошек', 30, 'гр.'''],
         ['майонез', 70, "мл."],
     ]
     ],
    ["пицца",
     [
         ["сыр", 50, "гр."],
         ["томаты", 50, "гр."],
         ["тесто", 100, "гр."],
         ["бекон", 30, "гр."],
         ["колбаса", 30, "гр."],
         ["грибы", 20, "гр."],
     ],
     ],
    ["фруктовый десерт",
     [
         ["хурма", 60, "гр."],
         ["киви", 60, "гр."],
         ["творог", 60, "гр."],
         ["сахар", 10, "гр."],
         ["мед", 50, "мл."],
     ]
     ]
]

person = int(input("Введите количество персон:"))

for meal_instruction in cook_book:
    meal = meal_instruction[0]
    ingredients = meal_instruction[1]
    instruction = f'{meal.capitalize()}:\n' + "\n".join(f'{i[0]}, {i[1] * person}{i[2]}' for i in ingredients)
    print(instruction, "\n")